Revit 2027 API
ExportPatternKey(FillPatternTarget, String) Constructor
 Constructs a new ExportPatternKey using the original fill pattern type and name as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportPatternKey(
	FillPatternTarget originalFillPatternType,
	string originalFillPatternName
)
Public Sub New (
	originalFillPatternType As FillPatternTarget,
	originalFillPatternName As String
)
public:
ExportPatternKey(
	FillPatternTarget originalFillPatternType,
	String^ originalFillPatternName
)
new :
        originalFillPatternType : FillPatternTarget *
        originalFillPatternName : string -> ExportPatternKey
Parameters
originalFillPatternType FillPatternTarget
 The original FillPattern type.
originalFillPatternName String
 The original FillPattern name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExportPatternKey Class
ExportPatternKey Overload
Autodesk.Revit.DB Namespace